<?php

declare(strict_types=1);

$config = require __DIR__ . '/config.php';

$jsonFile = $config['cache_file'];

/*
|--------------------------------------------------------------------------
| Якщо JSON ще не існує — генеруємо його
|--------------------------------------------------------------------------
*/

if (!file_exists($jsonFile)) {

    require __DIR__ . '/generate.php';

}

/*
|--------------------------------------------------------------------------
| Якщо JSON старший за 30 хвилин — оновлюємо
|--------------------------------------------------------------------------
*/

if (filemtime($jsonFile) < (time() - 1800)) {

    require __DIR__ . '/generate.php';

}

/*
|--------------------------------------------------------------------------
| Віддаємо JSON
|--------------------------------------------------------------------------
*/

header('Content-Type: application/json; charset=utf-8');

readfile($jsonFile);
